CDE-CIP-TNDISPATCHER-0700-main/server/src/test/resources/unittests/MnXmlResponseParserTest-mixedRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:schemas-cybersource-com:transaction-data-2.3">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
            <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="wsuId">
                <wsse:Username>wsse.username</wsse:Username>
                <wsse:Password  Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">wsse.password</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <urn:requestMessages>
            <requestMessage>
                <srcSystem>
                    <name>true</name>
                    <sysIndicator>false</sysIndicator>
                    <messageId>msg001001</messageId>
                </srcSystem>
                <card>
                    <accountNumber>accountNumber</accountNumber>
                    <cardType>V</cardType>
                    <expirationMonth>12</expirationMonth>
                    <expirationYear>2018</expirationYear>
                </card>
                <ccTokenizeService run="true"/>
            </requestMessage>
            <requestMessage>
                <srcSystem>
                    <name>true</name>
                    <sysIndicator>false</sysIndicator>
                    <messageId>msg001002</messageId>
                </srcSystem>
                <card>
                    <token>1234000012340000</token>
                </card>
                <ccDeTokenizeService run="true"/>
            </requestMessage>
            <requestMessage>
                <srcSystem>
                    <name>true</name>
                    <sysIndicator>false</sysIndicator>
                    <messageId>msg001003</messageId>
                </srcSystem>
                <card>
                    <token>1234000012340099</token>
                </card>
                <ccDeTokenizeService run="true"/>
            </requestMessage>
        </urn:requestMessages>
    </soapenv:Body>
</soapenv:Envelope>
